data-raw/a.html

<?xml version="1.0"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="https://www.cnj.jus.br/sgt/sgt_ws.php" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="sgt_ws_methods" targetNamespace="https://www.cnj.jus.br/sgt/sgt_ws.php"><types><xsd:schema targetNamespace="https://www.cnj.jus.br/sgt/sgt_ws.php"><xsd:complexType name="ArrayOfItem"><xsd:complexContent><xsd:restriction base="soap-enc:Array"><xsd:attribute ref="soap-enc:arrayType" wsdl:arrayType="tns:Item[]"/></xsd:restriction></xsd:complexContent></xsd:complexType><xsd:complexType name="Item"><xsd:all><xsd:element name="cod_item" type="xsd:int"/><xsd:element name="cod_item_pai" type="xsd:int"/><xsd:element name="nome" type="xsd:string"/><xsd:element name="dscGlossario" type="xsd:string"/></xsd:all></xsd:complexType><xsd:complexType name="ArrayOfArvoreGenerica"><xsd:complexContent><xsd:restriction base="soap-enc:Array"><xsd:attribute ref="soap-enc:arrayType" wsdl:arrayType="tns:ArvoreGenerica[]"/></xsd:restriction></xsd:complexContent></xsd:complexType><xsd:complexType name="ArvoreGenerica"><xsd:all><xsd:element name="seq_elemento" type="xsd:int"/><xsd:element name="dsc_elemento" type="xsd:string"/><xsd:element name="seq_elemento_pai" type="xsd:int"/><xsd:element name="temFilhos" type="xsd:string"/><xsd:element name="situacao" type="xsd:string"/><xsd:element name="filhos" type="tns:ArrayOfArvoreGenerica"/></xsd:all></xsd:complexType><xsd:complexType name="ArrayOfComplementoMovimento"><xsd:complexContent><xsd:restriction base="soap-enc:Array"><xsd:attribute ref="soap-enc:arrayType" wsdl:arrayType="tns:ComplementoMovimento[]"/></xsd:restriction></xsd:complexContent></xsd:complexType><xsd:complexType name="ComplementoMovimento"><xsd:all><xsd:element name="seqComplemento" type="xsd:int" nillable="true"/><xsd:element name="seqTipoComplemento" type="xsd:int" nillable="true"/><xsd:element name="seqComplMov" type="xsd:int" nillable="true"/><xsd:element name="dscComplemento" type="xsd:string" nillable="true"/><xsd:element name="dscObservacao" type="xsd:string" nillable="true"/><xsd:element name="arrayValoresTabelados" type="soap-enc:Array" nillable="true"/><xsd:element name="arrayMovimentosVinculados" type="soap-enc:Array" nillable="true"/></xsd:all></xsd:complexType></xsd:schema></types><portType name="sgt_ws_methodsPort"><operation name="pesquisarItemPublicoWS"><documentation>Pesquisa as tabelas publicas de acordo com os parametros passados</documentation><input message="tns:pesquisarItemPublicoWSIn"/><output message="tns:pesquisarItemPublicoWSOut"/></operation><operation name="getArrayDetalhesItemPublicoWS"><documentation>Retorna uma array do objeto preenchido de acordo com o item requisitado</documentation><input message="tns:getArrayDetalhesItemPublicoWSIn"/><output message="tns:getArrayDetalhesItemPublicoWSOut"/></operation><operation name="getArrayFilhosItemPublicoWS"><input message="tns:getArrayFilhosItemPublicoWSIn"/><output message="tns:getArrayFilhosItemPublicoWSOut"/></operation><operation name="getStringPaisItemPublicoWS"><documentation>Retorna uma string contendo o encadeamento de pais de um item</documentation><input message="tns:getStringPaisItemPublicoWSIn"/><output message="tns:getStringPaisItemPublicoWSOut"/></operation><operation name="getComplementoMovimentoWS"><documentation>Retorna uma string contendo o encadeamento de pais de um item</documentation><input message="tns:getComplementoMovimentoWSIn"/><output message="tns:getComplementoMovimentoWSOut"/></operation><operation name="getDataUltimaVersao"><documentation>Retorna uma string contendo o encadeamento de pais de um item</documentation><input message="tns:getDataUltimaVersaoIn"/><output message="tns:getDataUltimaVersaoOut"/></operation></portType><binding name="sgt_ws_methodsBinding" type="tns:sgt_ws_methodsPort"><soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="pesquisarItemPublicoWS"><soap:operation soapAction="https://www.cnj.jus.br/sgt/sgt_ws.php#pesquisarItemPublicoWS"/><input><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></input><output><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></output></operation><operation name="getArrayDetalhesItemPublicoWS"><soap:operation soapAction="https://www.cnj.jus.br/sgt/sgt_ws.php#getArrayDetalhesItemPublicoWS"/><input><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></input><output><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></output></operation><operation name="getArrayFilhosItemPublicoWS"><soap:operation soapAction="https://www.cnj.jus.br/sgt/sgt_ws.php#getArrayFilhosItemPublicoWS"/><input><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></input><output><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></output></operation><operation name="getStringPaisItemPublicoWS"><soap:operation soapAction="https://www.cnj.jus.br/sgt/sgt_ws.php#getStringPaisItemPublicoWS"/><input><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></input><output><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></output></operation><operation name="getComplementoMovimentoWS"><soap:operation soapAction="https://www.cnj.jus.br/sgt/sgt_ws.php#getComplementoMovimentoWS"/><input><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></input><output><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></output></operation><operation name="getDataUltimaVersao"><soap:operation soapAction="https://www.cnj.jus.br/sgt/sgt_ws.php#getDataUltimaVersao"/><input><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></input><output><soap:body use="literal" namespace="https://www.cnj.jus.br/sgt/sgt_ws.php"/></output></operation></binding><service name="sgt_ws_methodsService"><port name="sgt_ws_methodsPort" binding="tns:sgt_ws_methodsBinding"><soap:address location="https://www.cnj.jus.br/sgt/sgt_ws.php"/></port></service><message name="pesquisarItemPublicoWSIn"><part name="tipoTabela" type="xsd:string"/><part name="tipoPesquisa" type="xsd:string"/><part name="valorPesquisa" type="xsd:string"/></message><message name="pesquisarItemPublicoWSOut"><part name="return" type="tns:ArrayOfItem"/></message><message name="getArrayDetalhesItemPublicoWSIn"><part name="seqItem" type="xsd:string"/><part name="tipoItem" type="xsd:string"/></message><message name="getArrayDetalhesItemPublicoWSOut"><part name="return" type="soap-enc:Array"/></message><message name="getArrayFilhosItemPublicoWSIn"><part name="seqItem" type="xsd:int"/><part name="tipoItem" type="xsd:string"/></message><message name="getArrayFilhosItemPublicoWSOut"><part name="return" type="tns:ArrayOfArvoreGenerica"/></message><message name="getStringPaisItemPublicoWSIn"><part name="seqItem" type="xsd:int"/><part name="tipoItem" type="xsd:string"/></message><message name="getStringPaisItemPublicoWSOut"><part name="return" type="xsd:string"/></message><message name="getComplementoMovimentoWSIn"><part name="codMovimento" type="xsd:int"/></message><message name="getComplementoMovimentoWSOut"><part name="return" type="tns:ArrayOfComplementoMovimento"/></message><message name="getDataUltimaVersaoIn"/><message name="getDataUltimaVersaoOut"><part name="return" type="xsd:string"/></message></definitions>
